frontend/CustomerPortal/Home/Controllers/HomeController.php

select * from `tbl_citizen_charters` where `can_show_on_admin` = 1 and `deleted_at` is null and `tbl_citizen_charters`.`deleted_at` is null
select * from `mst_designations` where `mst_designations`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 58, 59, 60, 61, 62, 63, 64, 65) and `mst_designations`.`deleted_at` is null
select * from `mst_employees` where `deleted_at` is null and `mst_employees`.`deleted_at` is null
select * from `tbl_programs` where `can_show_on_admin` = 1 and `deleted_at` is null
select * from `tbl_videos` where `can_show_on_admin` = 1 and `deleted_at` is null
select * from `tbl_notices` where `can_show_on_admin` = 1
select * from `tbl_pop_ups` where `can_show_on_admin` = 1 and `tbl_pop_ups`.`deleted_at` is null order by `created_at` desc limit 1
---
                function () {
                    return Page::where('slug', 'service')->value('content');
                },
            ]);
        });

        [$grievanceCount, $grievancesInvestigatingCount, $grievancesClosedCount, $services] = $grievanceData;

        $citizenCharters = CitizenCharter::where('can_show_on_admin', true)->whereNull('deleted_at')->get();
        $employees = Employee::whereNull('deleted_at')->with('designation')->get();
        $programs = Program::where('can_show_on_admin', true)->whereNull('deleted_at')->get();
        $videos = Video::where('can_show_on_admin', true)->whereNull('deleted_at')->get();
        $notices = Notice::where('can_show_on_admin', true)->get();
        $popupData = PopUp::where('can_show_on_admin', true)->latest()->first();