app/View/Components/EmployeeSectionComponent.php

    public function __construct()
    {
        $this->employees = Cache::remember('employees_section', 3600, function () {
            $employees = Employee::with('designation')
                ->whereIn('type', ['temporary staff', 'permanent staff'])
                ->orderBy('position')
                ->get();
---
select * from `mst_designations` where `mst_designations`.`id` in (1, 2, 3, 4, 5, 6, 13, 14, 15, 16, 17, 18, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 58, 59, 60, 61, 62, 63, 64, 65) and `mst_designations`.`deleted_at` is null
select * from `mst_employees` where `type` in ('temporary staff', 'permanent staff') and `mst_employees`.`deleted_at` is null order by `position` asc